#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(improper_ctypes)]
#![allow(dead_code)]
#[cfg(feature = "hi3559av100")]
use lazy_static::lazy_static;

use std::convert::TryInto;

pub const KHRONOS_SUPPORT_INT64: u32 = 1;
pub const KHRONOS_SUPPORT_FLOAT: u32 = 1;
pub const KHRONOS_MAX_ENUM: u32 = 2147483647;

pub type khronos_int32_t = i32;
pub type khronos_uint32_t = u32;
pub type khronos_int64_t = i64;
pub type khronos_uint64_t = u64;
pub type khronos_int8_t = ::std::os::raw::c_schar;
pub type khronos_uint8_t = ::std::os::raw::c_uchar;
pub type khronos_int16_t = ::std::os::raw::c_short;
pub type khronos_uint16_t = ::std::os::raw::c_ushort;
pub type khronos_intptr_t = ::std::os::raw::c_long;
pub type khronos_uintptr_t = ::std::os::raw::c_ulong;
pub type khronos_ssize_t = ::std::os::raw::c_long;
pub type khronos_usize_t = ::std::os::raw::c_ulong;
pub type khronos_float_t = f32;
pub type khronos_utime_nanoseconds_t = khronos_uint64_t;
pub type khronos_stime_nanoseconds_t = khronos_int64_t;

#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum khronos_boolean_enum_t {
    KHRONOS_FALSE = 0,
    KHRONOS_TRUE = 1,
    KHRONOS_BOOLEAN_ENUM_FORCE_SIZE = 2147483647,
}

#[repr(C)]
#[derive(Copy, Clone, Debug, Default)]
pub struct fbdev_window {
    pub width: ::std::os::raw::c_ushort,
    pub height: ::std::os::raw::c_ushort,
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union mem_handle {

                    dma.handles[0].fd = DBE.wrap_fd(phy_addr, dma.planes[0].size);
                }
            }
            PIXMAP_FORMAT_NV21_BT709_WIDE => {
                dma.planes[0].stride = w;
                dma.planes[0].size = dma.planes[0].stride * h;
                dma.planes[0].offset = 0;
                dma.planes[1].stride = w;
                dma.planes[1].size = dma.planes[0].stride * h / 2;
                dma.planes[1].offset = dma.planes[0].size;
                unsafe {
                    dma.handles[0].fd =
                        DBE.wrap_fd(phy_addr, dma.planes[0].size + dma.planes[1].size);
                    dma.handles[1].fd = dma.handles[0].fd;
                }
            }
            PIXMAP_FORMAT_P010 => {
                dma.planes[0].stride = w * 2;
                dma.planes[0].size = dma.planes[0].stride * h;
                dma.planes[0].offset = 0;
                dma.planes[1].stride = w * 2;
                dma.planes[1].size = dma.planes[1].stride * h / 2;
                dma.planes[1].offset = dma.planes[0].size;
                unsafe {
                    dma.handles[0].fd =
                        DBE.wrap_fd(phy_addr, dma.planes[0].size + dma.planes[1].size);
                    dma.handles[1].fd = dma.handles[0].fd;
                }
            }
            _ => unreachable!(),
        }
        dma
    }
    #[cfg(not(feature = "hi3559av100"))]
    pub fn new(_phy_addr: u64, _width: isize, _height: isize, _format: u64) -> Self {
        unimplemented!()
    }
}

#[cfg(feature = "hi3559av100")]
impl Drop for linux_pixmap {
    fn drop(&mut self) {
        for a in &self.handles {
            unsafe {
                libc::close(a.fd);
            }
        }
    }
}

#[derive(Clone, Debug)]
pub struct NativePixmap {
    dma: *mut linux_pixmap,
    id: NativePixmapType,
    valid: bool,
}

impl NativePixmap {
    pub fn new(phy_addr: u64, width: isize, height: isize, format: u64) -> Self {
        unsafe {
            let dma = Box::new(linux_pixmap::new(phy_addr, width, height, format));
            let dma = Box::into_raw(dma);
            let id = create_pixmap_ID_mapping(dma);
            Self {
                dma: dma,
                id: id,
                valid: true,
            }
        }
    }

    pub fn id(&self) -> NativePixmapType {
        self.id
    }
}

impl Default for NativePixmap {
    fn default() -> Self {
        Self {
            dma: std::ptr::null_mut(),
            id: 0,
            valid: false,
        }
    }
}

impl Drop for NativePixmap {
    fn drop(&mut self) {
        if self.valid {
            unsafe {
                destroy_pixmap_ID_mapping(self.id);
                drop(Box::from_raw(self.dma));
            }
        }
    }
}

// Re-Export types
pub use types::*;

#[cfg(test)]
mod tests {
    use super::*;
    use std::convert::TryInto;

    #[test]
    fn test_layout_fbdev_window() {
        assert_eq!(
            ::std::mem::size_of::<fbdev_window>(),
            4usize,
            concat!("Size of: ", stringify!(fbdev_window))
        );
        assert_eq!(
            ::std::mem::align_of::<fbdev_window>(),
            2usize,
            concat!("Alignment of ", stringify!(fbdev_window))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<fbdev_window>())).width as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(fbdev_window),
                "::",
                stringify!(width)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<fbdev_window>())).height as *const _ as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(fbdev_window),
                "::",
                stringify!(height)
            )
        );
    }

    #[test]
    fn test_layout_mem_handle() {
        assert_eq!(
            ::std::mem::size_of::<mem_handle>(),
            4usize,
            concat!("Size of: ", stringify!(mem_handle))
        );
        assert_eq!(
            ::std::mem::align_of::<mem_handle>(),
            4usize,
            concat!("Alignment of ", stringify!(mem_handle))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<mem_handle>())).fd as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(mem_handle),
                "::",
                stringify!(fd)
            )
        );
    }

    #[test]
    fn test_layout_linux_pixmap_plane() {
        assert_eq!(
            ::std::mem::size_of::<linux_pixmap_plane>(),
            24usize,
            concat!("Size of: ", stringify!(linux_pixmap_plane))
        );
        assert_eq!(
            ::std::mem::align_of::<linux_pixmap_plane>(),
            8usize,
            concat!("Alignment of ", stringify!(linux_pixmap_plane))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linux_pixmap_plane>())).stride as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(linux_pixmap_plane),
                "::",
                stringify!(stride)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linux_pixmap_plane>())).size as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(linux_pixmap_plane),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linux_pixmap_plane>())).offset as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(linux_pixmap_plane),
                "::",
                stringify!(offset)
            )
        );
    }

    #[test]
    fn test_layout_linux_pixmap() {
        assert_eq!(
            ::std::mem::size_of::<linux_pixmap>(),
            104usize,
            concat!("Size of: ", stringify!(linux_pixmap))
        );
        assert_eq!(
            ::std::mem::align_of::<linux_pixmap>(),
            8usize,
            concat!("Alignment of ", stringify!(linux_pixmap))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linux_pixmap>())).width as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(linux_pixmap),
                "::",
                stringify!(width)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linux_pixmap>())).height as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(linux_pixmap),
                "::",
                stringify!(height)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linux_pixmap>())).planes as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(linux_pixmap),
                "::",
                stringify!(planes)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linux_pixmap>())).pixmap_format as *const _ as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(linux_pixmap),
                "::",
                stringify!(pixmap_format)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linux_pixmap>())).handles as *const _ as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(linux_pixmap),
                "::",
                stringify!(handles)
            )
        );
    }

    #[test]
    fn test_layout_dummy_display() {
        assert_eq!(
            ::std::mem::size_of::<dummy_display>(),
            56usize,
            concat!("Size of: ", stringify!(dummy_display))
        );
        assert_eq!(
            ::std::mem::align_of::<dummy_display>(),
            8usize,
            concat!("Alignment of ", stringify!(dummy_display))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<dummy_display>())).width as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(dummy_display),
                "::",
                stringify!(width)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<dummy_display>())).height as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(dummy_display),
                "::",
                stringify!(height)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<dummy_display>())).bytes_per_pixel as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(dummy_display),
                "::",
                stringify!(bytes_per_pixel)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<dummy_display>())).red_mask as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(dummy_display),
                "::",
                stringify!(red_mask)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<dummy_display>())).green_mask as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(dummy_display),
                "::",
                stringify!(green_mask)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<dummy_display>())).blue_mask as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(dummy_display),
                "::",
                stringify!(blue_mask)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<dummy_display>())).alpha_mask as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(dummy_display),
                "::",
                stringify!(alpha_mask)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<dummy_display>())).front_buffer as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(dummy_display),
                "::",
                stringify!(front_buffer)
            )
        );
    }

    #[cfg(feature = "hi3559av100")]
    #[test]
    fn test_layout_hidbe_ioctl_wrap() {
        assert_eq!(
            ::std::mem::size_of::<hidbe_ioctl_wrap>(),
            16usize,
            concat!("Size of: ", stringify!(hidbe_ioctl_wrap))
        );
        assert_eq!(
            ::std::mem::align_of::<hidbe_ioctl_wrap>(),
            8usize,
            concat!("Alignment of ", stringify!(hidbe_ioctl_wrap))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<hidbe_ioctl_wrap>())).dbe_phyaddr as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(hidbe_ioctl_wrap),
                "::",
                stringify!(dbe_phyaddr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<hidbe_ioctl_wrap>())).dbe_size as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(hidbe_ioctl_wrap),
                "::",
                stringify!(dbe_size)
            )
        );
    }

    #[test]
    fn test_load_with() {
        use crate::so::SharedObject;

        let so = SharedObject::load("libEGL.so");
        load_with(|s| so.get_proc_address(s));
        load_with_priv(|s| so.get_proc_address(s));

        unsafe {
            let dpy = GetDisplay(DEFAULT_DISPLAY);
            Initialize(dpy, std::ptr::null_mut(), std::ptr::null_mut());
            let apis = std::ffi::CStr::from_ptr(QueryString(dpy, CLIENT_APIS.try_into().unwrap()));
            println!("EGL_CLIENT_APIS={:?}", apis);
        }
    }
}
